c5/src/Documents/PickupOrder/PickupOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PickupOrder</name>
  <posting>Deny</posting>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Required</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Picked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Shipments</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Shipment</name>
      <type>
        <types>DocumentRef.Shipment</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/ShipmentPoints/ShipmentPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ShipmentPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Picking</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/PickupOrder/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	filterByStatus ();
	readAppearance ();
	Appearance.Apply ( ThisObject );
		
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Status show ( empty ( StatusFilter ) or StatusFilter = Enum.ShipmentPoints.All )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure init ()
	
	settings = Logins.Settings ( "Warehouse, Department" );
	WarehouseFilter = settings.Warehouse;
	
EndProcedure 

&AtServer
Procedure filterByStatus ()
	
	if ( StatusFilter.IsEmpty () ) then
		a = new Array ();
		a.Add ( Enums.ShipmentPoints.New );
		a.Add ( Enums.ShipmentPoints.Picking );
		DC.ChangeFilter ( List, "Status", a, true );
	else
		DC.ChangeFilter ( List, "Status", StatusFilter, StatusFilter <> Enums.ShipmentPoints.All );
	endif; 
	Appearance.Apply ( ThisObject, "StatusFilter" );
	
EndProcedure 

&AtServer
Procedure filterByWarehouse ()
	
	DC.ChangeFilter ( List, "Warehouse", WarehouseFilter, not WarehouseFilter.IsEmpty () );
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure Create ( Command )
	
	newPickupOrder ();
	
EndProcedure

&AtClient
Procedure newPickupOrder ()
	
	p = new Structure ( "Warehouse", WarehouseFilter );
	OpenForm ( "DataProcessor.PickupOrder.Form", p, ThisObject );
	
EndProcedure 

&AtClient
Procedure StatusFilterOnChange ( Item )
	
	filterByStatus ();
	
EndProcedure

&AtClient
Procedure WarehouseFilterOnChange ( Item )
	
	filterByWarehouse ();
	
EndProcedure
